import { QuestionData } from "../questions";

export const arQuestions: QuestionData[] = [
  {
    id: 1,
    question: "إذا كان لديك وقت للانتظار في المطار، ماذا ستفعل؟",
    options: [
      { text: "محاولة بدء محادثات مع أشخاص جدد.", type: "E" },
      { text: "تحية الأشخاص من حولك بشكل غير رسمي.", type: "E" },
      { text: "الاستمتاع بوقت وحدك مع كتاب أو فيلم.", type: "I" },
      { text: "الاسترخاء بهدوء وتنظيم خططك القادمة.", type: "I" }
    ]
  },
  {
    id: 2,
    question: "ما هو أسلوبك عند التخطيط لرحلة؟",
    options: [
      { text: "تخطيط كل لحظة بالتفصيل.", type: "S" },
      { text: "تحضير ما هو ضروري فقط في قائمة.", type: "S" },
      { text: "تحديد اتجاه عام والسير مع التيار.", type: "N" },
      { text: "استكشاف بحرية دون أي خطط.", type: "N" }
    ]
  },
  {
    id: 3,
    question: "ماذا تأخذ بعين الاعتبار عند اتخاذ القرارات؟",
    options: [
      { text: "الحكم بناءً على المنطق والحقائق.", type: "T" },
      { text: "إعطاء الأولوية للكفاءة قبل كل شيء.", type: "T" },
      { text: "أخذ مشاعر الآخرين بعين الاعتبار أولاً.", type: "F" },
      { text: "تقدير آراء الآخرين.", type: "F" }
    ]
  },
  {
    id: 4,
    question: "كيف تتعامل مع التوتر أثناء السفر؟",
    options: [
      { text: "التواصل مع الناس في الأماكن المحلية المفعمة بالحيوية.", type: "E" },
      { text: "قضاء الوقت وحدك في مكان هادئ.", type: "I" },
      { text: "تحليل المشكلة والبحث عن حلول.", type: "T" },
      { text: "مشاركة مشاعرك والتحدث مع المرافقين.", type: "F" }
    ]
  },
  {
    id: 5,
    question: "كيف تختار الطعام في وجهة سفر جديدة؟",
    options: [
      { text: "الاطلاع على التقييمات واختيار قائمة موثوقة.", type: "S" },
      { text: "اختيار القائمة الأكثر شيوعًا.", type: "S" },
      { text: "تجربة أطباق فريدة لم ترها من قبل.", type: "N" },
      { text: "طلب أطعمة جديدة بناءً على ما يلفت انتباهك.", type: "N" }
    ]
  },
  {
    id: 6,
    question: "ماذا ستفعل إذا نشأت خلافات مع رفيق السفر؟",
    options: [
      { text: "شرح الموقف بشكل منطقي لحله.", type: "T" },
      { text: "اقتراح بدائل واقعية.", type: "T" },
      { text: "الاهتمام أولاً بمشاعر رفيقك.", type: "F" },
      { text: "التعاطف عاطفيًا وحل النزاع.", type: "F" }
    ]
  },
  {
    id: 7,
    question: "كيف تقوم بتعبئة أمتعتك للسفر؟",
    options: [
      { text: "إعداد قائمة بالأشياء الضرورية وتجهيزها مسبقًا.", type: "J" },
      { text: "الاستعداد بهدوء قبل يوم من المغادرة.", type: "J" },
      { text: "التعبئة الخفيفة لأن الرحلة نفسها هي الأهم.", type: "P" },
      { text: "التعبئة بسرعة في اللحظة الأخيرة.", type: "P" }
    ]
  },
  {
    id: 8,
    question: "كيف تختار المعالم السياحية؟",
    options: [
      { text: "اختيار المعالم الشهيرة وذات التقييم الجيد.", type: "S" },
      { text: "البحث عن أماكن ذات أهمية تاريخية.", type: "S" },
      { text: "استكشاف أماكن فريدة يعرفها السكان المحليون فقط.", type: "N" },
      { text: "البحث عن أماكن سرية لا تظهر حتى على الخرائط.", type: "N" }
    ]
  },
  {
    id: 9,
    question: "كيف تتفاعل مع مواقف غير متوقعة أثناء السفر؟",
    options: [
      { text: "تذكر تجارب مشابهة سابقة لحل المشكلة.", type: "S" },
      { text: "التحدث مع الأشخاص القريبين للبحث عن حل.", type: "E" },
      { text: "البحث عن حلول ممكنة بشكل منطقي.", type: "T" },
      { text: "النظر أولاً إلى مشاعر وآراء الآخرين.", type: "F" }
    ]
  },
  {
    id: 10,
    question: "كيف ستستغل الوقت المتبقي في وجهة السفر؟",
    options: [
      { text: "قضاء وقت هادئ بمفردك.", type: "I" },
      { text: "العثور على أماكن فريدة لم تزورها بعد.", type: "N" },
      { text: "التخطيط بالتفصيل لاستخدام وقتك بكفاءة.", type: "J" },
      { text: "التجول بشكل عفوي إلى حيث تأخذك قدماك.", type: "P" }
    ]
  }
];